import React from "react";

const CarrierPlan: React.FC = () => {
  return (
    <div>
      <h2>キャリアプラン</h2>
      <h3>PdM, エヴァンジェリスト</h3>
      <p>
        プロダクトが好きなので、将来的にはプロダクトに深く関わって意思決定をしていくPdMのようなポジションを目指しています。
      </p>
      <p>
        また、自分の目標とする方が企業のエヴァンジェリストをやっており、そこに強い憧れもあるので、自分自身がエヴァンジャライズしたいプロダクトに出会えた時には、是非そのようなキャリアにも挑戦してみたいと思っています。
      </p>
      <h3>ITの蛇口化</h3>
      <p>蛇口を見れば、万人が「捻れば水が出る」と理解できます。</p>
      <p>
        そのようにソフトウェアでも、説明無しに利用できるUIから、ITの恩恵を受けられるようなソフトウェアを作っていきたいと思っています。
      </p>
      <p>
        そのためにはソフトウェアの知識のみならず、ユーザー側の深いドメイン知識も必要になるので、積極的に足で情報を取りに行くというスタイルを取っています。
      </p>
    </div>
  );
};

export default CarrierPlan;
